tonyrang/dsp_study/03-firmware/TMS320F28075/adc_ex1_soc_software/device/driverlib/inc/hw_clbxbar.h
//*****************************************************************************
//
// The following are defines for the bit fields in the AUXSIG2MUXENABLE register
//
//*****************************************************************************
#define XBAR_AUXSIG2MUXENABLE_MUX0  0x1U         // mux0 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX1  0x2U         // MUX1 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX2  0x4U         // MUX2 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX3  0x8U         // MUX3 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX4  0x10U        // MUX4 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX5  0x20U        // MUX5 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX6  0x40U        // MUX6 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX7  0x80U        // MUX7 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX8  0x100U       // MUX8 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX9  0x200U       // MUX9 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX10  0x400U       // MUX10 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX11  0x800U       // MUX11 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX12  0x1000U      // MUX12 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX13  0x2000U      // MUX13 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX14  0x4000U      // MUX14 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX15  0x8000U      // MUX15 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX16  0x10000U     // MUX16 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX17  0x20000U     // MUX17 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX18  0x40000U     // MUX18 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX19  0x80000U     // MUX19 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX20  0x100000U    // MUX20 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX21  0x200000U    // MUX21 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX22  0x400000U    // MUX22 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX23  0x800000U    // MUX23 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX24  0x1000000U   // MUX24 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX25  0x2000000U   // MUX25 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX26  0x4000000U   // MUX26 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX27  0x8000000U   // MUX27 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX28  0x10000000U  // MUX28 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX29  0x20000000U  // MUX29 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX30  0x40000000U  // MUX30 to drive AUXSIG2 of
                                               // CLB-XBAR
#define XBAR_AUXSIG2MUXENABLE_MUX31  0x80000000U  // MUX31 to drive AUXSIG2 of
                                               // CLB-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the AUXSIG3MUXENABLE register
//
//*****************************************************************************
#define XBAR_AUXSIG3MUXENABLE_MUX0  0x1U         // mux0 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX1  0x2U         // MUX1 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX2  0x4U         // MUX2 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX3  0x8U         // MUX3 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX4  0x10U        // MUX4 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX5  0x20U        // MUX5 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX6  0x40U        // MUX6 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX7  0x80U        // MUX7 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX8  0x100U       // MUX8 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX9  0x200U       // MUX9 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX10  0x400U       // MUX10 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX11  0x800U       // MUX11 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX12  0x1000U      // MUX12 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX13  0x2000U      // MUX13 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX14  0x4000U      // MUX14 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX15  0x8000U      // MUX15 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX16  0x10000U     // MUX16 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX17  0x20000U     // MUX17 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX18  0x40000U     // MUX18 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX19  0x80000U     // MUX19 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX20  0x100000U    // MUX20 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX21  0x200000U    // MUX21 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX22  0x400000U    // MUX22 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX23  0x800000U    // MUX23 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX24  0x1000000U   // MUX24 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX25  0x2000000U   // MUX25 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX26  0x4000000U   // MUX26 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX27  0x8000000U   // MUX27 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX28  0x10000000U  // MUX28 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX29  0x20000000U  // MUX29 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX30  0x40000000U  // MUX30 to drive AUXSIG3 of
                                               // CLB-XBAR
#define XBAR_AUXSIG3MUXENABLE_MUX31  0x80000000U  // MUX31 to drive AUXSIG3 of
                                               // CLB-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the AUXSIG4MUXENABLE register
//
//*****************************************************************************
#define XBAR_AUXSIG4MUXENABLE_MUX0  0x1U         // mux0 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX1  0x2U         // MUX1 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX2  0x4U         // MUX2 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX3  0x8U         // MUX3 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX4  0x10U        // MUX4 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX5  0x20U        // MUX5 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX6  0x40U        // MUX6 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX7  0x80U        // MUX7 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX8  0x100U       // MUX8 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX9  0x200U       // MUX9 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX10  0x400U       // MUX10 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX11  0x800U       // MUX11 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX12  0x1000U      // MUX12 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX13  0x2000U      // MUX13 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX14  0x4000U      // MUX14 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX15  0x8000U      // MUX15 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX16  0x10000U     // MUX16 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX17  0x20000U     // MUX17 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX18  0x40000U     // MUX18 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX19  0x80000U     // MUX19 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX20  0x100000U    // MUX20 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX21  0x200000U    // MUX21 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX22  0x400000U    // MUX22 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX23  0x800000U    // MUX23 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX24  0x1000000U   // MUX24 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX25  0x2000000U   // MUX25 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX26  0x4000000U   // MUX26 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX27  0x8000000U   // MUX27 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX28  0x10000000U  // MUX28 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX29  0x20000000U  // MUX29 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX30  0x40000000U  // MUX30 to drive AUXSIG4 of
                                               // CLB-XBAR
#define XBAR_AUXSIG4MUXENABLE_MUX31  0x80000000U  // MUX31 to drive AUXSIG4 of
                                               // CLB-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the AUXSIG5MUXENABLE register
//
//*****************************************************************************
#define XBAR_AUXSIG5MUXENABLE_MUX0  0x1U         // mux0 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX1  0x2U         // MUX1 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX2  0x4U         // MUX2 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX3  0x8U         // MUX3 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX4  0x10U        // MUX4 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX5  0x20U        // MUX5 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX6  0x40U        // MUX6 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX7  0x80U        // MUX7 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX8  0x100U       // MUX8 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX9  0x200U       // MUX9 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX10  0x400U       // MUX10 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX11  0x800U       // MUX11 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX12  0x1000U      // MUX12 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX13  0x2000U      // MUX13 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX14  0x4000U      // MUX14 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX15  0x8000U      // MUX15 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX16  0x10000U     // MUX16 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX17  0x20000U     // MUX17 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX18  0x40000U     // MUX18 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX19  0x80000U     // MUX19 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX20  0x100000U    // MUX20 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX21  0x200000U    // MUX21 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX22  0x400000U    // MUX22 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX23  0x800000U    // MUX23 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX24  0x1000000U   // MUX24 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX25  0x2000000U   // MUX25 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX26  0x4000000U   // MUX26 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX27  0x8000000U   // MUX27 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX28  0x10000000U  // MUX28 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX29  0x20000000U  // MUX29 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX30  0x40000000U  // MUX30 to drive AUXSIG5 of
                                               // CLB-XBAR
#define XBAR_AUXSIG5MUXENABLE_MUX31  0x80000000U  // MUX31 to drive AUXSIG5 of
                                               // CLB-XBAR

//*****************************************************************************
//
// The following are defines for the bit fields in the AUXSIG6MUXENABLE register
//
//*****************************************************************************
#define XBAR_AUXSIG6MUXENABLE_MUX0  0x1U         // mux0 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX1  0x2U         // MUX1 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX2  0x4U         // MUX2 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX3  0x8U         // MUX3 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX4  0x10U        // MUX4 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX5  0x20U        // MUX5 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX6  0x40U        // MUX6 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX7  0x80U        // MUX7 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX8  0x100U       // MUX8 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX9  0x200U       // MUX9 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX10  0x400U       // MUX10 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX11  0x800U       // MUX11 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX12  0x1000U      // MUX12 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX13  0x2000U      // MUX13 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX14  0x4000U      // MUX14 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX15  0x8000U      // MUX15 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX16  0x10000U     // MUX16 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX17  0x20000U     // MUX17 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX18  0x40000U     // MUX18 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX19  0x80000U     // MUX19 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX20  0x100000U    // MUX20 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX21  0x200000U    // MUX21 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX22  0x400000U    // MUX22 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX23  0x800000U    // MUX23 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX24  0x1000000U   // MUX24 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX25  0x2000000U   // MUX25 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX26  0x4000000U   // MUX26 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX27  0x8000000U   // MUX27 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX28  0x10000000U  // MUX28 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX29  0x20000000U  // MUX29 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX30  0x40000000U  // MUX30 to drive AUXSIG6 of
                                               // CLB-XBAR
#define XBAR_AUXSIG6MUXENABLE_MUX31  0x80000000U  // MUX31 to drive AUXSIG6 of
                                               // CLB-XBAR

